{
    "linkedinUrl": "https://www.linkedin.com/in/aymenmrad/",
    "connections": 30842,
    "education": [
        {
            "degree": "Bachelor's degree",
            "school": "University of Manouba UMA",
            "field": "Geomatics",
            "dateRange": {
                "start": {
                    "year": 2005
                },
                "end": {
                    "year": 2008
                }
            }
        },
        {
            "degree": "Human Resource Management ",
            "school": "International Business Management Institute (IBMI)",
            "field": "Business, Management, Marketing, and Related Support Services",
            "dateRange": {
                "start": {
                    "year": 2019
                },
                "end": {
                    "year": 2020
                }
            }
        }
    ],
    "languages": [
        {
            "language": "Italian",
            "proficiency": "FULL_PROFESSIONAL"
        },
        {
            "language": "French",
            "proficiency": "NATIVE_OR_BILINGUAL"
        },
        {
            "language": "English",
            "proficiency": "FULL_PROFESSIONAL"
        }
    ],
    "positions": [
        {
            "title": "Team Leader",
            "company": "Transcom",
            "description": "• Creating an inspiring team environment with an open communication culture.\n• Setting clear team goals.\n• Delegating tasks and set deadlines.\n• Oversesing day-to-day operation.\n• Monitoring my team performance and report on metrics.\n• Motivating my Team members.\n• Discover training needs and providing coaching.\n• Listening to my Team members’ feedback and resolve any issues or conflicts.\n• Recognizing high performance and reward accomplishments.\n• Encouraging creativity and risk-taking.\n• Suggesting and organizing team building activities.",
            "dateRange": {
                "start": {
                    "month": 9,
                    "year": 2011
                },
                "end": {
                    "month": 10,
                    "year": 2013
                }
            }
        },
        {
            "title": "International Senior Recruiter",
            "company": "Global Recruiters of Montreal (GRN)",
            "description": "Global Recruiters of Montreal comprises of professional permanent executive search consultants with specialization in the areas of Manufacturing, Long Term Health Care and Technical and Trades Professionals. \n\nOur firm offers client companies in Canada and the United States and candidates world wide comprehensive consulting services with integrity, personal attention and confidentiality with the highest professional standards. We attract and present qualified candidates in record time because of our continuous quality training, our outstanding field support and GRN's unparalleled advanced technology in the search consulting industry. \n\nMission : I am providing to client companies and candidates with integrity, personal attention and confidentiality at the highest professional standards.\n\n• Designing and implementing overall recruiting strategy.\n• Consulting with managers to discover staff requirements and specific job objectives.\n• Sourcing candidates by using databases and social media.\n• Evaluate and screen resumes and cover letters.\n• Using the recruiting tools like tests and assignments to assess candidates’ skills.\n• Finding clients and fostering long-term relationships\n• Understanding client requirements\n• Attending job fairs and careers events\n• Employing recruiting methods to attract candidates",
            "dateRange": {
                "start": {
                    "month": 9,
                    "year": 2018
                }
            }
        },
        {
            "title": "Business Development Specialist",
            "company": "Immigration.ca",
            "description": "Immigration.ca, #1 Google ranked, is the most recognized legal practice in the Canadian immigration industry, on-line.\n\nIt is the only one-word domain name in the industry and since its inception, it has been consistently rated the most popular non-government Canadian immigration web site by Google.\n\nWe provide unparalleled counsel and expertise to foreign nationals intending to relocate to Canada, the United States, the United Kingdom and Australia on a temporary or permanent basis.\n\nThe firm acts as legal counsel on immigration matters, to a number of Canadian based institutions and a myriad of domestic and international corporate businesses. This aspect of our practice affords us an in-depth understanding of Canada's business and labour market landscape and adds to our ability to counsel clients who intend to relocate foreign nationals to Canada.\n\nWe regularly provide insight and commentary to Canada’s national media and US based media, Canadian citizenship and immigration personnel and foreign representatives both in Canada and abroad when immigration policy is reviewed or modified by the Federal and Provincial Governments. \n\nThe latest media items below (video content), is a confirmation of our highly respected standing in the Canadian immigration industry.",
            "dateRange": {
                "start": {
                    "month": 5,
                    "year": 2018
                }
            }
        },
        {
            "title": "Career Coach",
            "company": "Skilled Worker",
            "description": "SkilledWorker is an in-house recruitment enterprise of Immigration.ca. We bring foreign skilled workers to Canada under temporary and permanent residence immigration programs.\n\n• Develop effective job coaching and employment plans\n• Communicate with clients to understand their goals and ambitions\n• Assist clients to discover and overcome their personal barriers and set goals\n• Assess the strengths of individuals and teach them to use them effectively\n• Guide clients in learning to complete job tasks\n• Help in the development of motivation and skills\n• Provide coaching in effective job search techniques\n• Assist people with disabilities in developing social and life skills\n• Advise on workplace accommodations for people with disabilities\n• Monitor and evaluate progress of clients\n• Keep records and documentation and prepare appropriate reports",
            "dateRange": {
                "start": {
                    "month": 6,
                    "year": 2019
                }
            }
        },
        {
            "title": "Trainee",
            "company": "La Poste Tunisienne",
            "description": "Traineeship as Internal Officer assigned for banking transactions.",
            "dateRange": {
                "start": {
                    "month": 6,
                    "year": 2006
                },
                "end": {
                    "month": 8,
                    "year": 2006
                }
            }
        },
        {
            "title": "Senior Lead",
            "company": "AlmavivA",
            "description": "• Providing precise information to generate the earnings and growth forecast.\n• Responding pro-actively to the variations in the established service levels and targets.\n• Managing & keep up to date the applications, databases & documentation corresponding. \n• Preparing reports on the evolution of my team's in relation to results & the service quality.\n• Creating an inspiring co-workers environment with an open communication culture.\n• Discover training needs and providing coaching.\n• Suggesting and organizing team building activities.",
            "dateRange": {
                "start": {
                    "month": 2,
                    "year": 2008
                },
                "end": {
                    "month": 11,
                    "year": 2010
                }
            }
        },
        {
            "title": "HR Project Manager ",
            "company": "Transcom",
            "description": "Mission : HR Area acting as Recruitment & Growth Pilot | 04/2013 - 09/2015 \n\n• Designing and implementing overall recruiting strategy.\n• Consulting with managers to discover staff requirements and specific job objectives.\n• Writing and post job descriptions on career websites, newspapers and universities boards.\n• Sourcing candidates by using databases and social media.\n• Evaluate and screen resumes and cover letters.\n• Using the recruiting tools like tests and assignments to assess candidates’ skills.\n• Conducting phone, Skype and/or in-person interviews.\n• Providing a shortlist of qualified candidates to hiring managers.\n• Helping the hiring team with recruiting methods and interview questions.\n• Contacting new employees and prepare onboarding sessions.\n• Preparing new hire paperwork ensuring legislation requirements are met.\n• Maintaining a complete record of interviews and new hires.\n• Stay up-to-date with current recruiting methods.\n• Attending job fairs and careers events.\n\nMission : Operation Area acting as Project Manager | 10/2015 - 05/2016 \n\n• Ensuring that all projects are delivered on-time, within scope and within budget\n• Developing project scopes & objectives, involving all relevant stakeholders.\n• Ensuring resource availability and allocation.\n• Developing a detailed project plan to track progress.\n• Measuring project performance using appropriate systems, tools and techniques.\n• Reporting and escalating to management as needed.\n• Managing the relationship with the client and all stakeholders.\n• Performing risk management to minimize project risks.\n• Establishing and maintaining relationships with third parties/vendors.\n• Providing feedback to Corporate Governance on ideas for improving standards & processes.",
            "dateRange": {
                "start": {
                    "month": 11,
                    "year": 2013
                },
                "end": {
                    "month": 5,
                    "year": 2016
                }
            }
        },
        {
            "title": "Recruitment Manager",
            "company": "Transcom",
            "description": "Mission: Responsible for leadership, development, implementation and administration of recruitment programs and drive execution of an effective short-term recruiting strategy\n\n• Supervising the recruiting team and report on its performance.\n• Keeping track of recruiting metrics (e.g. time-to-hire and cost-per-hire).\n• Building a professional network through relationships with HR professionals & partners.\n• Recommending ways to improve our employer brand.\n• Stay up to date on labor legislation & inform Managers about changes in regulations.\n• Implementing new sourcing methods (e.g. social recruiting and Boolean searches).\n• Updating and design new recruiting procedures (job application & onboarding processes).\n• Reviewing recruitment software and suggest the best option for company needs.\n• Researching and choose job advertising options.\n• Advising hiring managers on interviewing techniques.\n• Coordinating with department managers to forecast future hiring needs.\n• Participating in job fairs and career events.",
            "dateRange": {
                "start": {
                    "month": 9,
                    "year": 2017
                },
                "end": {
                    "month": 3,
                    "year": 2018
                }
            }
        },
        {
            "title": "Graduate Trainee",
            "company": "NGI Maghreb",
            "description": "Traineeships as Junior GIS Assistant assigned for the start-up of NGI Maghreb : http://www.ngi-maghreb.com/\n\n• Providing effective & proactive technical project support in areas of GIS applications\n• Assisting with user support, training and administration\n• Preparing, reviewing and publishing spatial data\n• Assisting in the development of web based spatial applications",
            "dateRange": {
                "start": {
                    "month": 6,
                    "year": 2007
                },
                "end": {
                    "month": 8,
                    "year": 2007
                }
            }
        },
        {
            "title": "Site Manager",
            "company": "Cpl Integrated Services",
            "description": "Mission: Acting as Operation Delivery Manager  on-site at Hewlett Packard Enterprise. \nResponsible for data entry, accounts payable, grant report entry, managing the organizations HR, helping and creating organizational and program budgets in collaboration with the ED and Program Direct, and other misc. tasks.\n\n• Coordinating internal resources and 3th parties/vendors for executioning of Projects\n• Ensure that all projects are delivered on-time, within scope and within budget\n• Developing project by involving all relevant stakeholders & ensuring technical feasibility\n• Ensuring resource availability and allocation\n• Developing a detailed project plan to track progress\n• Using appropriate techniques to manage changes in project scope, schedule & costs\n• Measuring project performance using appropriate systems, tools and techniques\n• Reporting and escalate to management as needed\n• Managing the relationship with the client and all stakeholders\n• Performing the risk management to minimize project risks\n• Establishing and maintaining relationships with third parties/vendors\n• Creating and maintaining comprehensive project documentation",
            "dateRange": {
                "start": {
                    "month": 6,
                    "year": 2016
                },
                "end": {
                    "month": 8,
                    "year": 2017
                }
            }
        }
    ],
    "image": "https://media-exp1.licdn.com/dms/image/C5603AQFdCv1MHocmmQ/profile-displayphoto-shrink_200_200/0?e=1596672000&v=beta&t=lSegYKtNa_LorN4sBjLdoW3wsdWTWLPFKJ-QtSWJK4w",
    "bg": "https://media-exp1.licdn.com/dms/image/C5616AQHArkEEL1xOdg/profile-displaybackgroundimage-shrink_200_800/0?e=1596672000&v=beta&t=eeSPsr5_pEndLvtH2JiRWj8H9U1UHjuPIHgkiGMhZeo",
    "firstName": "Aymen",
    "lastName": "MRAD",
    "headline": "People Partner | Growth Strategist",
    "location": "Westmount, Quebec, Canada",
    "email": "aymenmrad@gmail.com",
    "phone": "+1 514-123-4567",
    "address": null,
    "industry": "Human Resources",
    "summary": "Hi, I'm Aymen!\n\nProfessionally, I pride myself in being an advocate of the employee experience by focusing on a strong customer service initiative, deep diving trends and creating action items accordingly. \nI strive to bring 100% of my positivity to the workplace. I thrive under pressure and enjoy being surrounded by ambiguity and fast pace. In a space of ten years of experience in a multinational companies & organizations, I have built a clear methodology to appreciate my skill in the different area like team management, my language skills, my knowledge in the field of recruitment and my openness to other cultures. \nThis background makes me always ready to start a new professional and human experience to challenge myself, more than that, my motto is “always to put people first” in everything i do.\n\nLooking forward to connecting and growing together!",
    "skills": [
        "Team Leadership",
        "Outsourcing",
        "Team Management",
        "Sourcing",
        "Microsoft Word",
        "Research",
        "Leadership",
        "Business Strategy",
        "Training",
        "Microsoft Excel",
        "Sales",
        "Management",
        "Adobe Photoshop",
        "Strategy",
        "PowerPoint",
        "Project Management",
        "Recruiting",
        "Customer Service",
        "Microsoft Office",
        "Strategic Planning"
    ]
}